import pandas as pd

# مسیر فایل اکسل
file_path = "dataset.xlsx"

# خواندن فایل
df = pd.read_excel(file_path)

# نمایش 5 سطر اول
print("🔹 نمونه داده‌ها:")
print(df.head())

print("\n🔹 نام ستون‌ها:")
print(df.columns)

# تعداد کل نمونه‌ها
print("\n🔹 تعداد کل نمونه‌ها:")
print(len(df))

# تعداد کلاس‌ها
print("\n🔹 تعداد کلاس‌های یکتا:")
print(df['label'].nunique())

# اسم کلاس‌ها
print("\n🔹 لیست کلاس‌ها:")
print(df['label'].unique())

# تعداد نمونه در هر کلاس
print("\n🔹 توزیع داده‌ها در کلاس‌ها:")
print(df['label'].value_counts())
